api/app/controllers/artists_controller.rb

SELECT "artists"."id", "artists"."name" FROM "artists" WHERE (UPPER(name) ~* '') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT("artists"."id") FROM "artists" WHERE (UPPER(name) ~* '')
SELECT COUNT("artists"."id") FROM "artists"
---
  def index

    if params[:intervalo]
      if params[:pg]
        @pagina = params[:pg].to_i
        @artists = Artist.all.withoutTimes.where("UPPER(name) ~* ?", params[:intervalo].upcase).limit(10).offset((@pagina - 1) * 10)
      else
        @artists = Artist.all.withoutTimes.where("UPPER(name) ~* ?", params[:intervalo].upcase)
      end
      @counter = Artist.all.onlyId.where("UPPER(name) ~* ?", params[:intervalo].upcase).count()
    else
      @artists = Artist.all.withoutTimes
      @counter = Artist.all.onlyId.count()