api/app/controllers/genders_controller.rb

  def index
    if params[:intervalo]
      if params[:pg]
        @pagina = params[:pg].to_i
        @genders = Gender.all.withoutTimes.where("UPPER(description) ~* ?", params[:intervalo].upcase).limit(10).offset((@pagina - 1) * 10)
      else
        @genders = Gender.all.withoutTimes.where("UPPER(description) ~* ?", params[:intervalo].upcase)
      end
      @counter = Gender.all.onlyId.where("UPPER(description) ~* ?", params[:intervalo].upcase).count()
    else
      @genders = Gender.all.withoutTimes
      @counter = Gender.all.onlyId.count()
---
SELECT "genders"."id", "genders"."description" FROM "genders" WHERE (UPPER(description) ~* 'ROCK AND') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(id, description) FROM "genders" WHERE (UPPER(description) ~* '')
SELECT "genders"."id", "genders"."description" FROM "genders" WHERE (description LIKE '%''abc''%')
SELECT COUNT("genders"."id") FROM "genders"