api/app/controllers/tipo_media_controller.rb

  def index
    if params[:intervalo]
      if params[:pg]
        @pagina = params[:pg].to_i
        @tipo_media = TipoMedia.all.withoutTimes.where("UPPER (description) ~* ?", params[:intervalo].upcase).limit(10).offset((@pagina - 1) * 10)
      else
        @tipo_media = TipoMedia.all.withoutTimes.where("UPPER (description) ~* ?", params[:intervalo].upcase)
      end
      @counter = TipoMedia.all.onlyId.where("UPPER (description) ~* ?", params[:intervalo].upcase).count()
    else
      @tipo_media = TipoMedia.all.withoutTimes
      @counter = TipoMedia.all.onlyId.count()
---
SELECT "tipo_media"."id", "tipo_media"."description" FROM "tipo_media" WHERE (UPPER (description) ~* 'RO') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT("tipo_media"."id") FROM "tipo_media" WHERE (UPPER (description) ~* 'RO?PG=1')
SELECT COUNT("tipo_media"."id") FROM "tipo_media"